In [2]:
import numpy as np
import pandas as pd

In [3]:
data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    1.058124
   2    1.487116
   3    0.312270
b  1   -1.024090
   3    1.538860
c  1    1.075470
   2   -0.360840
d  2    0.611922
   3    1.400308
dtype: float64

In [8]:
data1 = pd.Series(np.random.randn(9),index=['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'])
data1

a    0.529596
a    0.754455
a   -1.045299
b   -1.416874
b    2.026878
c   -0.347610
c   -0.929477
d    0.582230
d    1.201668
dtype: float64

In [11]:
data1["a"]

a    0.529596
a    0.754455
a   -1.045299
dtype: float64

In [10]:
data["a"]

1    1.058124
2    1.487116
3    0.312270
dtype: float64

In [12]:
data["a":"c"]

a  1    1.058124
   2    1.487116
   3    0.312270
b  1   -1.024090
   3    1.538860
c  1    1.075470
   2   -0.360840
dtype: float64

In [14]:
data[["a","c"]]

a  1    1.058124
   2    1.487116
   3    0.312270
c  1    1.075470
   2   -0.360840
dtype: float64

In [26]:
data.loc[:,2]

a    1.487116
c   -0.360840
d    0.611922
dtype: float64

In [27]:
data[:,2]

a    1.487116
c   -0.360840
d    0.611922
dtype: float64

In [28]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                    'c': ['one', 'one', 'one', 'two', 'two','two', 'two'],
                    'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [40]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [41]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [42]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [49]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K4'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [50]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [51]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K4  C3  D3

In [52]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [53]:
pd.merge(left,right,on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [54]:
#处理重复列名
df_obj1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
'data' : np.random.randint(0,10,7)})
df_obj2 = pd.DataFrame({'key': ['a', 'b', 'd'],
'data' : np.random.randint(0,10,3)})

In [55]:
df_obj1

  key  data
0   b     6
1   b     7
2   a     6
3   c     3
4   a     4
5   a     4
6   b     7

In [56]:
df_obj2

  key  data
0   a     3
1   b     5
2   d     5

In [59]:
pd.merge(df_obj1,df_obj2,on="key",suffixes=("_left", "_right"))

  key  data_left  data_right
0   b          6           5
1   b          7           5
2   b          7           5
3   a          6           3
4   a          4           3
5   a          4           3

In [60]:
pd.merge(df_obj1,df_obj2,on="key",suffixes=("_left", "_right"),how="outer")

  key  data_left  data_right
0   b        6.0         5.0
1   b        7.0         5.0
2   b        7.0         5.0
3   a        6.0         3.0
4   a        4.0         3.0
5   a        4.0         3.0
6   c        3.0         NaN
7   d        NaN         5.0

In [61]:
#按索引连接
df_obj1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
'data1' : np.random.randint(0,10,7)})
df_obj2 = pd.DataFrame({'data2' : np.random.randint(0,10,3)}, index=['a', 'b', 'd'])

In [62]:
df_obj1

  key  data1
0   b      8
1   b      9
2   a      6
3   c      6
4   a      8
5   a      6
6   b      0

In [63]:
df_obj2

   data2
a      8
b      1
d      5

In [67]:
pd.merge(df_obj1,df_obj2,left_on="key",right_index=True)

  key  data1  data2
0   b      8      1
1   b      9      1
6   b      0      1
2   a      6      8
4   a      8      8
5   a      6      8

In [69]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['语文', '数学'])

right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['英语', '综合'])

In [71]:
left2

    语文   数学
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [72]:
right2

     英语    综合
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [73]:
pd.merge(left2,right2,how="outer",left_index=True, right_index=True)

    语文   数学    英语    综合
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [77]:
pd.merge(left2,right2,how="left",left_index=True, right_index=True)

    语文   数学    英语    综合
a  1.0  2.0   NaN   NaN
c  3.0  4.0   9.0  10.0
e  5.0  6.0  13.0  14.0

In [78]:
left2.join(right2,how="outer")

    语文   数学    英语    综合
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

In [79]:
left2.join(right2)

    语文   数学    英语    综合
a  1.0  2.0   NaN   NaN
c  3.0  4.0   9.0  10.0
e  5.0  6.0  13.0  14.0

In [80]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),index=list('abc'),columns=['one','two'])

df2 = pd.DataFrame(np.arange(4).reshape(2,2)+5,index=list('ac'),columns=['one','two'])

In [81]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [82]:
df2

   one  two
a    5    6
c    7    8

In [83]:
pd.concat([df1,df2])

   one  two
a    0    1
b    2    3
c    4    5
a    5    6
c    7    8

In [84]:
pd.concat([df1,df2],axis=1)

   one  two  one  two
a    0    1  5.0  6.0
b    2    3  NaN  NaN
c    4    5  7.0  8.0

In [90]:
pd.concat([left2,right2],axis=1)

    语文   数学    英语    综合
a  1.0  2.0   NaN   NaN
c  3.0  4.0   9.0  10.0
e  5.0  6.0  13.0  14.0
b  NaN  NaN   7.0   8.0
d  NaN  NaN  11.0  12.0

In [111]:
data = pd.DataFrame(np.arange(6).reshape((2, 3))*15,
                    index=pd.Index(['老王', '小刘'], name='姓名'),
                    columns=pd.Index(['语文', '数学', '英语'],name='科目'))
data

科目  语文  数学  英语
姓名
老王   0  15  30
小刘  45  60  75

In [96]:
r=data.stack()
r

姓名  科目
老王  语文     0
    数学    15
    英语    30
小刘  语文    45
    数学    60
    英语    75
dtype: int32

In [101]:
r.unstack(0)

姓名  老王  小刘
科目
语文   0  45
数学  15  60
英语  30  75

In [102]:
r.unstack("姓名")

姓名  老王  小刘
科目
语文   0  45
数学  15  60
英语  30  75

In [103]:
r.unstack(1)

科目  语文  数学  英语
姓名
老王   0  15  30
小刘  45  60  75

In [105]:
r.unstack("科目")

科目  语文  数学  英语
姓名
老王   0  15  30
小刘  45  60  75

In [116]:
a1 = pd.Series(np.arange(4),index=pd.Index(list("abcd"),name="index"))
a1

index
a    0
b    1
c    2
d    3
dtype: int32

In [117]:
a2 = pd.Series([4,5,6],index=list('cde'))
a2

c    4
d    5
e    6
dtype: int64

In [119]:
s1 = pd.concat([a1,a2])
s1

a    0
b    1
c    2
d    3
c    4
d    5
e    6
dtype: int64

In [120]:
s1 = pd.concat([a1,a2],axis=1)
s1

     0    1
a  0.0  NaN
b  1.0  NaN
c  2.0  4.0
d  3.0  5.0
e  NaN  6.0

In [128]:
s1 = pd.concat([a1,a2],keys=["data1","data2"])
s1

data1  a    0
       b    1
       c    2
       d    3
data2  c    4
       d    5
       e    6
dtype: int64

In [129]:
s1.unstack()

         a    b    c    d    e
data1  0.0  1.0  2.0  3.0  NaN
data2  NaN  NaN  4.0  5.0  6.0

In [130]:
s1.unstack(0)

   data1  data2
a    0.0    NaN
b    1.0    NaN
c    2.0    4.0
d    3.0    5.0
e    NaN    6.0

In [132]:
s1.unstack().stack(dropna=False)

data1  a    0.0
       b    1.0
       c    2.0
       d    3.0
       e    NaN
data2  a    NaN
       b    NaN
       c    4.0
       d    5.0
       e    6.0
dtype: float64

In [135]:
df3 = pd.DataFrame({'date':['2018-11-22','2018-11-22','2018-11-23','2018-11-23','2018-11-24'],
                  'class':['a','b','b','c','c'],
                  'values':[5,3,2,6,1]},columns=['date','class','values'])
df3

         date class  values
0  2018-11-22     a       5
1  2018-11-22     b       3
2  2018-11-23     b       2
3  2018-11-23     c       6
4  2018-11-24     c       1

In [139]:
df3_ = df3.set_index(["date","class"])
df3_

                  values
date       class
2018-11-22 a           5
           b           3
2018-11-23 b           2
           c           6
2018-11-24 c           1

In [142]:
df3_.unstack(1)

           values
class           a    b    c
date
2018-11-22    5.0  3.0  NaN
2018-11-23    NaN  2.0  6.0
2018-11-24    NaN  NaN  1.0

In [145]:
df3.pivot("date","class")

           values
class           a    b    c
date
2018-11-22    5.0  3.0  NaN
2018-11-23    NaN  2.0  6.0
2018-11-24    NaN  NaN  1.0